/* 
১. বন্ধু যদি দাওয়াত দেয়, তাহলে তার জন্মদিনের পার্টিতে তুই যাবি। আর যদি তোকে দাওয়াত না দেয়, তাহলে তাকে ফ্রেন্ডলিস্ট থেকে বের করে দিবি। আর যদি বন্ধু দাওয়াত দিয়ে ফেলে, তাহলে দাওয়াতে যাওয়ার সময় চেক করে দেখবি, পকেটে কত টাকা আছে। যদি 1000 টাকার বেশি থাকে, তাহলে বন্ধুর জন্য একটা গিফট নিয়ে যাবি। না হয় খালি হাতে যাবি।
 */
let getInvite = true;
let pocketMoney = 1200;
if (getInvite) {
    console.log('জন্মদিনের পার্টিতে যাবো');
    if (pocketMoney > 1000) {
        console.log('বন্ধু তোর জিন্য গিফট আছে');
    }
    else {
        console.log('খালি হাতে যাবো');
    }
}
else {
    console.log(' ফ্রেন্ডলিস্ট থেকে বের করে দিবো');
}